<?php

declare(strict_types = 1);

return [
    "category"       => "Блог",
    "posts"          => "Посты",
    "post"           => "Пост",
    'confirm_delete' => 'Элемент будет удалён без возможности восстановления',
    'create'         => 'Добавить элемент',
    'deleted'        => 'Элемент удалён',
    'removed'        => 'Элемент удалён',
    'saved'          => 'Элемент сохранён',
    'update :name'   => 'Редактирование: :name',
    'update'         => 'Редактирование',

    'permissions' => [
        'post'     => [
            'view'   => 'Просмотр постов',
            'create' => 'Добавление постов',
            'update' => 'Обновление постов',
            'delete' => 'Удаление постов',
        ],
        'category' => [
            'view'   => 'Просмотр категорий',
            'create' => 'Добавление категорий',
            'update' => 'Обновление категорий',
            'delete' => 'Удаление категорий',
        ],
    ],
];
